// pages/animalIndex/animalIndex.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    scrollHeight: 0,
    introList: [{name: '分类',list: [
      {title: '本膳料理',desc:'将菜放在有脚的托盘上使用，一般分三菜一汤、五菜二汤、七菜三汤，以五菜二汤最为常见，亦会做成一定图型以示吉利。在吃的时候，每个人面前都要放上小桌，菜和汤鱼贯入场。现在正式的本膳料理已不多见，只出现在少数正式场合，如婚丧喜庆、成年仪式及祭典宴会上。'},
      {title: '怀石料理',desc:'在茶道会之前给客人准备的精美菜肴，是最早最正统的烹调系统。其形式为“一汁三菜”（也有一汁二菜）。极端讲求精致，无论餐具还是食物的摆放都要求很高，但食物的份量却很少，讲究环境幽静，料理简单而雅致，可感受到日本菜最原始的魅力以及古朴中的典雅。'},
      {title: '会席料理',desc:'不拘泥于形式的丰盛的宴席菜式，也叫宴会料理，可能是由本膳料理和怀石料理为基础，简化而成的。其中也包括各种乡土料理。会席料理通常在专门做日本菜的饭馆里可以品尝到。现在日本饭店里供应的宴席料理大多属于此类。'},
      {title: '桌袱料理',desc:'源于中国古代佛门素食，有蘑菇、鱼糕、蔬菜的汤面、卤面等。菜式中主要有：鱼翅清汤、茶、大盘、中盘、小菜、炖品、年糕小豆汤和水果。小菜：分为五菜、七菜、九菜，以七菜居多。一开始就先把小菜全部放在桌子上，边吃边将鱼翅清汤及其他菜肴摆上桌。'},
      {title: '茶会料理',desc:'室町时代（14世纪）盛行茶道，出现了茶宴茶会料理。最初只是茶道的点缀，十分简单，到了室町末期，变得非常豪华奢侈，其后茶道创始人千利休又恢复了它清淡素朴的面目，主食只用饭碗、汤碗和小碟子。席间还有汤、梅干、水果，有时还会送上两三味山珍海味，最后是上茶。'},
      {title: '大学料理',desc:'米饭：咖喱类、炒菜类、油炸类、盖浇饭类。咖喱：牛肉咖喱、炸肉饼咖喱、炸土豆泥饼咖喱。炒菜：生姜烧、麻婆豆腐、炒茄子。油炸：常见的有炸大虾、炸蔬菜等。盖浇饭：常见有牛肉盖浇饭、猪肉盖浇饭和鸡肉盖浇饭。面条类：乌冬面、鸡蛋拉面、荞麦面条等。'},
      {title: '面食料理',desc:'日本有好几种面条，比如乌冬面、荞麦面和宽切面等，这些面食配料讲究，价廉物美，尤其是荞麦面条。现在日本人用餐已逐步多样化，美式快餐、汉堡包、意大利面条，已部分替代了饭团。速冻食品如饺子、锅贴、包子、面类等中华料理也在日本走俏。'},
      {title: '修行料理',desc:'修行料理又叫“精进料理”，意思是吃斋、吃素。它原本是佛教徒食用的素餐。这种料理不用鱼贝类和肉类作原料，只用大豆加工品、蔬菜、海藻等植物性食品烹制而成。'},
      {title: '御节料理',desc:'把各种佳肴放在一个有五层格子的漆器小箱子里的一种节日料理，特别是在过年时的主要料理，所以又叫正月料理，通常也只说“御节、おせち”。据说过去举行特别仪式时供奉给神享用的，现在是盒装冷餐，通常在新年等重要节日时食用。'},
    ]},{name: '特点',list: [
      {title: '口味',desc: '日本料理就被称为“五味五色五法之菜”，“五味”是指甜、酸、辣、苦、咸；“五色”是指白、黄、红、青、黑；“五法”则是指生、煮、烤、炸、蒸的烹调法。其基本特点是：季节性强；味道鲜美，保持原味清淡不腻，很多菜都是生吃；选料以海味和蔬菜为主，加工精细，色彩鲜艳。'},
      {title: '原料',desc: '日本料理的原料要保证新鲜度。蔬菜以各种芋头、小茄子、萝卜、豆角等为主。鱼类的季节性也很强，春季吃鲷鱼，初夏吃松鱼，盛夏吃鳗鱼，初秋吃鲭花鱼，秋吃刀鱼，深秋吃鲑鱼，冬天吃鲥鱼和海豚。肉类以牛肉为主，其次是鸡肉和猪肉，但猪肉是较少用的。另外，使用蘑菇的品种比较多。'},
      {title: '烹制',desc: '在烹制上主要保持菜的新鲜度和菜的本身味道，不尚油腻，清淡新鲜。其中很多菜以生吃为主。在做法上也多以煮、烤、蒸为主，带油的菜是极少。在加味的方法上大都以先放糖、味淋酒，后放酱油、盐，因糖和酒不但起调节口味的作用，而且还能维护素菜里的各种营养成分，味精也尽量少放。'},
      {title: '配料',desc: '在日本料理中做菜上大都以木鱼花汤为主，极少使用水，高级菜都是用木鱼花汤和清酒为主。清酒用量也很多。日菜使用的酱油有淡口、浓口、重口。淡口色浅一点，浓口为一般酱油，重口颜色深口味上略甜。小酒菜甜、咸、酸为主，汤菜清淡为主，量少而精。大酱也多种多样，一般早餐用信州大酱或白大酱作酱汤而午晚用赤大酱。配菜装饰物也季节而变化。'},
      {title: '外形',desc: '日本菜加工精细，讲求美感，追求艺术性，拼摆别致。摆出的菜有主有次有点缀，拼色则红、黄、绿、白、黑协调。拼摆的形式有：杉形（圆锥形）、叠式、散式、平面式、品字形和混合式等，可随意搭配借鉴，只要整体美观、色泽艳丽、色调柔和，让人看后悦目清心就可以。'},
    ]},{name: '吃法',list: [
      {title: '寿司',desc: '拿好寿司，注意不要紧捏，微微倾斜，把它反过来，然后轻轻沾点酱油，把整件寿司放进口裡。把寿司反过来是因为直接把酱油沾到米饭上容易使饭团散掉，也会因米饭沾得太多酱油而破坏寿司的味道。'},
      {title: '生鱼片',desc: '吃生鱼片沾芥末也是有讲究的，沾芥末有两种方法：一是将生鱼片盘中的芥末挖一些到酱油碟子内，与酱油搅拌均匀备用。第二种是将芥末沾到生鱼片上，再将生鱼片沾酱油入食。沾佐料时应该沾前三分之一，轻轻沾取，不要贪多，佐料多了会盖住生鱼片本身的鲜味。'},
      {title: '干杯',desc: '在日本一起聚餐时，一般都会等大家一起举杯说过'},
    ]},{name: '礼仪',list: [
      {title: '干杯',desc: '在日本一起聚餐时，一般都会等大家一起举杯说过“干杯”之后才开始进餐。尤其是到了年底和年初的时候。但注意，日本人喝酒时所说的干杯只不过是一种习惯用语，并非真的要将杯中酒喝光。'},
      {title: '进日式客房',desc: '日式榻榻米客房在进房间时，一般需要脱鞋。鞋的方法应该是将鞋头朝外放。首先面朝客房脱下鞋子，然后蹲坐在廊间，用手将鞋子拎起调头往内放，注意背对客房脱鞋是不礼貌的。'},
      {title: '座位安排',desc: '一般而言，包房里上司或贵宾应该坐离门口最远的位置为上座，而职位或辈份比较低的人坐在离门口最近的地方。如果是正规的宴会的话，日本人一般都会安排一名叫做“干事”的人来打点一切，最后也是由这个人负责交钱，这个人一般坐在离门口最近的地方。'},
    ]}],
    repreList: [
      {title: '寿司',url: 'cloud://cloud1-0gbl62895c1a16cd.636c-cloud1-0gbl62895c1a16cd-1309406244/a1.jpeg',desc: '寿司是日本人最喜爱的传统食物之一，主要材料是用醋调味过的冷饭，再加上鱼肉，海鲜，蔬菜或鸡蛋等作配料，其味道鲜美，很受日本民众的喜爱。'},
      {title: '拉面',url: 'cloud://cloud1-0gbl62895c1a16cd.636c-cloud1-0gbl62895c1a16cd-1309406244/a2.jpeg',desc: '日本拉面，来自中国但在日本成为代表性的大众面食。日文为“ラーメン（ramen）”、“そば（soba）（荞麦面条）”、“中华そば”等。'},
      {title: '天妇罗',url: 'cloud://cloud1-0gbl62895c1a16cd.636c-cloud1-0gbl62895c1a16cd-1309406244/a3.png',desc: '天妇罗是油炸食品，用面粉、鸡蛋与水和成浆，将新鲜的鱼虾和时令蔬菜裹上浆放入油锅炸成金黄色。吃时蘸酱油和萝卜泥汁，香而不腻。'},
      {title: '刺身',url: 'cloud://cloud1-0gbl62895c1a16cd.636c-cloud1-0gbl62895c1a16cd-1309406244/a4.jpeg',desc: '刺身是日本的一种传统食品，最出名的日本料理之一，将鱼、虾、蟹、贝类等肉类利用特殊刀工切成片、条、块等形状，蘸山葵泥、酱油等，直接生食。'},
      {title: '乌冬面',url: 'cloud://cloud1-0gbl62895c1a16cd.636c-cloud1-0gbl62895c1a16cd-1309406244/a5.jpeg',desc: '乌冬面，又作乌龙，在国内被叫做乌冬面。是一种以小麦为原料制造的传统日本面，在粗细和长度方面有特别的规定，特点为面条白而粗，软而柔。'},
      {title: '味增汤',url: 'cloud://cloud1-0gbl62895c1a16cd.636c-cloud1-0gbl62895c1a16cd-1309406244/a6.jpeg',desc: '味噌，又称面豉酱，以黄豆为主原料，加入盐及不同的种麴发酵而成。是日本最受欢迎的调味料，既可做汤又能烹煮肉菜，还能做成火锅汤底。'},
      {title: '纳豆',url: 'cloud://cloud1-0gbl62895c1a16cd.636c-cloud1-0gbl62895c1a16cd-1309406244/a7.jpeg',desc: '纳豆由黄豆通过纳豆菌（枯草杆菌）发酵制成的，盛产于日本的一种保健食品。日本人主要食用咸纳豆与拉丝纳豆，关西人喜欢前者，关东人则爱吃后者。'},
      {title: '清酒',url: 'cloud://cloud1-0gbl62895c1a16cd.636c-cloud1-0gbl62895c1a16cd-1309406244/a8.jpeg',desc: '即米酒，中国称之为“醪糟”，在晋代传入日本。日本清酒原料单纯到只用米和水，就可以产生出令人难以忘怀的好滋味，深具地方特色，也称为地酒。'},
      {title: '日式饭团',url: 'cloud://cloud1-0gbl62895c1a16cd.636c-cloud1-0gbl62895c1a16cd-1309406244/a9.jpeg',desc: '日本饭团传统为三角状，饭团中裹上一颗腌制酸梅，外面裹上一片干海苔包裹，中间还伴有鱼肉丁和梅子丁等。传统来讲，里面鱼肉一般是三文鱼或金枪鱼。'},
      {title: '荞麦面',url: 'cloud://cloud1-0gbl62895c1a16cd.636c-cloud1-0gbl62895c1a16cd-1309406244/a10.jpeg',desc: '荞麦面，由荞麦面粉和水和面压平后切制而成。七割荞麦用七成荞麦面粉和三成小麦面粉混制，口感较滑嫩，十割荞麦（生荞麦）只用荞麦面，香味较强。'},
      {title: '日式火锅',url: 'cloud://cloud1-0gbl62895c1a16cd.636c-cloud1-0gbl62895c1a16cd-1309406244/a11.jpeg',desc: '日式火锅是日本的传统饮食方式，古而有之，历史久远。分为寿喜烧火锅、海鲜火锅、山产火锅等分类，讲求使用纯美高汤调味、使用药味佐料，美味营养。'},
      {title: '章鱼烧',url: 'cloud://cloud1-0gbl62895c1a16cd.636c-cloud1-0gbl62895c1a16cd-1309406244/a12.jpeg',desc: '章鱼烧，即章鱼小丸子，章鱼小丸子的成份主要是章鱼，章鱼烧粉，柴鱼片，海苔等，素有皮酥肉嫩、味美价廉之特点，成为日本家喻户晓的国粹小吃。'},
      {title: '寿喜烧',url: 'cloud://cloud1-0gbl62895c1a16cd.636c-cloud1-0gbl62895c1a16cd-1309406244/a13.jpeg',desc: '寿喜烧，又可称为锄烧，主要以牛肉、青葱、蔬菜、蒟蒻、豆腐为主，酱汁与程序，则依地域不同，而有不同的配方与程序。'},
      {title: '丼类',url: 'cloud://cloud1-0gbl62895c1a16cd.636c-cloud1-0gbl62895c1a16cd-1309406244/a14.jpeg',desc: '丼类，可以理解为盖饭，最普遍的五大丼为GYUDON、KATSUDON、OYADON，TANDON及UNADON。'},
      {title: '咖喱饭',url: 'cloud://cloud1-0gbl62895c1a16cd.636c-cloud1-0gbl62895c1a16cd-1309406244/a15.jpeg',desc: '日本咖喱，加入了浓缩果泥，所以甜味较重，除了可以伴饭吃外，还可以作为拉面和乌龙面等汤面类食物的汤底，这方面和其他地方的咖哩有较大分别。'},
      {title: '猪排饭',url: 'cloud://cloud1-0gbl62895c1a16cd.636c-cloud1-0gbl62895c1a16cd-1309406244/a16.jpeg',desc: '猪排饭以炸猪排饭为主流，一种在大碗上放上一块猪排，多配以生熟蛋和洋葱在饭上，口感香口；另一种则把切好的猪排放在碟子上和白饭分开配以佐汁。'},
    ],
    selectList: [],
    categoryIndex: 0,
    categoryIndex1: 0,
    listIndex: 0,
    selectDesc: '',
    showLevel: '0'
  },

  levelTap(event){
    const index = event.target.dataset.index
    const list = this.data.introList[0].list
    const url = this.data.repreList[0].url
    const desc = this.data.repreList[0].desc
    if(index==='0'){
      this.setData({
        showLevel: index,
        selectList: list
      })
    }else{
      this.setData({
        showLevel: index,
        selectDesc: desc,
        selectUrl: url
      })
    }
  },

  bindCategoryTap(event){
    const index = event.currentTarget.dataset.index
    const list = event.currentTarget.dataset.item.list
    this.setData({
      listIndex: 0,
      categoryIndex: index,
      selectList: list
    })
  },

  handleClick(event){
    let index = event.currentTarget.dataset.index
    if(this.data.listIndex===index){
      this.setData({
        listIndex: null
      })
    }else{
      this.setData({
        listIndex: index
      })
    }
  },

  bindCategoryDesc(event){
    const index = event.currentTarget.dataset.index
    const url = this.data.repreList[index].url
    const desc = this.data.repreList[index].desc
    this.setData({
      categoryIndex1: index,
      selectDesc: desc,
      selectUrl: url
    })
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {
    // 获取系统信息
    wx.getSystemInfo({
      success: res=> {
          this.setData({
              scrollHeight: res.windowHeight - 42,
          });
      }
    });
    const list = this.data.introList[0].list
    this.setData({
      selectList: list
    })
  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})